# DATAFRAMES

## Curso Udemy Python

In [3]:
import pandas as pd
archivo = 'DatosDemograficos.csv'
path = 'recursos'
datos = pd.read_csv(path + '/' + archivo)
datos

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

**Otra manera**

In [7]:
import os
#os.getcwd() para seleccionar el path actual
os.chdir(path)
datos_2 = pd.read_csv(archivo)
datos_2

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

## OPERACIONES CON DATASETS

In [9]:
len(datos) #numero de filas

195

In [11]:
# ver las columnas
datos.columns

Index(['Nombre del Pais', 'Codigo de Pais', 'Tasa de Natalidad',
       'Usuarios de Internet', 'Grupo de ingresos'],
      dtype='object')

In [13]:
len(datos.columns) # numero de columnas

5

In [15]:
#filas superiores
datos.head() # datos.head(10) para mostrar las 10 filas superiores

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [17]:
datos.tail() #filas inferiores

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo

In [19]:
datos.info() # información de las columnas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Nombre del Pais       195 non-null    object
 1   Codigo de Pais        195 non-null    object
 2   Tasa de Natalidad     195 non-null    float64
 3   Usuarios de Internet  195 non-null    float64
 4   Grupo de ingresos     195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [23]:
#obtener estadisticas de las columnas
datos.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Tasa de Natalidad,195.0,21.469928,10.605467,7.9,12.1205,19.68,29.7595,49.6610
Usuarios de Internet,195.0,42.076471,29.030788,0.9,14.5200,41.00,66.2250,96.5468

### Cambiar nombre columnas en datasets

In [27]:
#cambiar nombre a las columnas
datos_2.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [31]:
datos_2.columns = ['a', 'b', 'c', 'd', 'e']

In [33]:
datos_2.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [37]:
# filas
datos[21:26] #para solo una cantidad de filas filas
datos[:] # para todas las filas
datos[:10] # desde el principio hasta el 10 = datos.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9000,Ingreso alto
1,Afghanistan,AFG,35.253,5.9000,Ingreso bajo
2,Angola,AGO,45.985,19.1000,Ingreso medio alto
3,Albania,ALB,12.877,57.2000,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0000,Ingreso alto
5,Argentina,ARG,17.716,59.9000,Ingreso alto
6,Armenia,ARM,13.308,41.9000,Ingreso medio bajo
7,Antigua and Barbuda,ATG,16.447,63.4000,Ingreso alto
8,Australia,AUS,13.200,83.0000,Ingreso alto
9,Austria,AUT,9.400,80.6188,Ingreso alto

In [39]:
#invierte el data frame
datos[::-1]

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
...,...,...,...,...,...
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
2,Angola,AGO,45.985,19.1,Ingreso medio alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
0,Aruba,ABW,10.244,78.9,Ingreso alto

In [41]:
#obtener cada 20 paises o filas
datos[0::20]

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9000,Ingreso alto
20,Belarus,BLR,12.500,54.1700,Ingreso medio alto
40,Costa Rica,CRI,15.022,45.9600,Ingreso medio alto
60,Gabon,GAB,30.555,9.2000,Ingreso medio alto
80,India,IND,20.291,15.1000,Ingreso medio bajo
100,Libya,LBY,21.425,16.5000,Ingreso medio alto
120,Mozambique,MOZ,39.705,5.4000,Ingreso bajo
140,Poland,POL,9.600,62.8492,Ingreso alto
160,Suriname,SUR,18.455,37.4000,Ingreso medio alto
180,Uruguay,URY,14.374,57.6900,Ingreso alto

In [55]:
#columnas
datos[['Nombre del Pais', 'Tasa de Natalidad']].head()
# acceso rápido 
# datos.TasaNatalidad solo sirve para sacar una columna y si la columna tiene el nombre sin espacios

        Nombre del Pais  Tasa de Natalidad
0                 Aruba             10.244
1           Afghanistan             35.253
2                Angola             45.985
3               Albania             12.877
4  United Arab Emirates             11.044

**extraer solo unas columnas y filas concretas**

In [61]:
datos[['Nombre del Pais', 'Tasa de Natalidad']][4:8]

        Nombre del Pais  Tasa de Natalidad
4  United Arab Emirates             11.044
5             Argentina             17.716
6               Armenia             13.308
7   Antigua and Barbuda             16.447

In [ ]:
datos[4:8][['Nombre del Pais', 'Tasa de Natalidad']] #hace lo mismo que el anterior

In [ ]:
#igual
df2 = datos[['Nombre del Pais', 'Tasa de Natalidad']]
df2[4:8]

### Operaciones matemáticas con datasets

In [13]:
resultado = datos['Tasa de Natalidad'] * datos['Usuarios de Internet']
resultado

0      808.2516
1      207.9927
2      878.3135
3      736.5644
4      971.8720
         ...
190    658.9400
191    969.5250
192     93.2668
193    623.2534
194    660.7275
Length: 195, dtype: float64

In [15]:
# agregar columna
datos['MiCalculo'] = datos['Tasa de Natalidad'] * datos['Usuarios de Internet']

In [17]:
datos.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos,MiCalculo
0,Aruba,ABW,10.244,78.9,Ingreso alto,808.2516
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo,207.9927
2,Angola,AGO,45.985,19.1,Ingreso medio alto,878.3135
3,Albania,ALB,12.877,57.2,Ingreso medio alto,736.5644
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto,971.8720

**Borrar columna (hay q asignar el dataset de nuevo a la variable)**

In [ ]:
# borrar columnas
datos = datos.drop('MiCalculo',axis=1)

In [29]:
datos.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

**Otra opción para borrar una columna sería  
del datos[‘Micalculo’]**

### Cambiar el título de una columna

In [ ]:
datos_unidos.rename(columns={'NombrePais_x': 'NombrePais'}, inplace=True)

### Filtro en dataset

In [59]:
filtro = datos['Usuarios de Internet'] < 2

In [63]:
filtro

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: Usuarios de Internet, Length: 195, dtype: bool

In [18]:
#no hace falta asignar el filtro a una variable
datos[datos['Tasa de Natalidad'] > 40]

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
2,Angola,AGO,45.985,19.1,Ingreso medio alto
11,Burundi,BDI,44.151,1.3,Ingreso bajo
14,Burkina Faso,BFA,40.551,9.1,Ingreso bajo
65,"Gambia, The",GMB,42.525,14.0,Ingreso bajo
115,Mali,MLI,44.138,3.5,Ingreso bajo
127,Niger,NER,49.661,1.7,Ingreso bajo
128,Nigeria,NGA,40.045,38.0,Ingreso medio bajo
156,Somalia,SOM,43.891,1.5,Ingreso bajo
167,Chad,TCD,45.745,2.3,Ingreso bajo
178,Uganda,UGA,43.474,16.2,Ingreso bajo
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo

In [61]:
#Para filtrar por varios valores
filtro = datos['Usuarios de Internet'] < 2
filtro_2 = datos['Tasa de Natalidad'] > 40

0      False
1      False
2       True
3      False
4      False
       ...
190    False
191    False
192     True
193     True
194    False
Name: Tasa de Natalidad, Length: 195, dtype: bool

In [65]:
# tasa natalidad mayor a 40 y usuario de internet mayor q 2
#datos[[datos['Tasa de Natalidad'] > 40] &  datos['Usuarios de Internet'] < 2]
datos[filtro & filtro_2]

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
11,Burundi,BDI,44.151,1.3,Ingreso bajo
127,Niger,NER,49.661,1.7,Ingreso bajo
156,Somalia,SOM,43.891,1.5,Ingreso bajo

In [67]:
# o sin variables
datos[(datos['Tasa de Natalidad'] > 40) & (datos['Usuarios de Internet'] < 2)]

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
11,Burundi,BDI,44.151,1.3,Ingreso bajo
127,Niger,NER,49.661,1.7,Ingreso bajo
156,Somalia,SOM,43.891,1.5,Ingreso bajo

### Para ver los valores únicos

In [69]:
datos.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [71]:
datos['Grupo de ingresos'].unique()

array(['Ingreso alto', 'Ingreso bajo', 'Ingreso medio alto',
       'Ingreso medio bajo'], dtype=object)

### Filtrar por un dato

In [79]:
#Encontrar todo lo de malta
filtro_malta = datos['Nombre del Pais'] == 'Malta'

In [81]:
filtro_malta

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: Nombre del Pais, Length: 195, dtype: bool

In [83]:
datos[filtro_malta]

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
116,Malta,MLT,9.5,68.9138,Ingreso alto

In [30]:
# otra opción
datos[datos['Nombre del Pais'] == 'Malta']

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
116,Malta,MLT,9.5,68.9138,Ingreso alto

In [93]:
datos.head()

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

### Como acceder a celdas en concreto

.at con el nombre de la columna		dataset.at[num fila , “nombre columna”]   
.iat con numero de fila y columna		dataset.iat[num fila , num columna]   
.iat utiliza la indexación

In [95]:
datos.iat[3,4]

'Ingreso medio alto'

In [97]:
datos.at[2, 'Tasa de Natalidad']

45.985

**Diferencia entre iat y at** 
At coge el numero de etiqueta (no de fila) y iat coge el numero real de fila en el filtro

In [36]:
sub10 = datos[::10]

In [101]:
sub10

,Nombre del Pais,Codigo de Pais,Tasa de Natalidad,Usuarios de Internet,Grupo de ingresos
0,Aruba,ABW,10.244,78.900000,Ingreso alto
10,Azerbaijan,AZE,18.300,58.700000,Ingreso medio alto
20,Belarus,BLR,12.500,54.170000,Ingreso medio alto
30,Canada,CAN,10.900,85.800000,Ingreso alto
40,Costa Rica,CRI,15.022,45.960000,Ingreso medio alto
50,Ecuador,ECU,21.070,40.353684,Ingreso medio alto
60,Gabon,GAB,30.555,9.200000,Ingreso medio alto
70,Greenland,GRL,14.500,65.800000,Ingreso alto
80,India,IND,20.291,15.100000,Ingreso medio bajo
90,Kazakhstan,KAZ,22.730,54.000000,Ingreso medio alto
100,Libya,LBY,21.425,16.500000,Ingreso medio alto
110,Moldova,MDA,12.141,45.000000,Ingreso medio bajo
120,Mozambique,MOZ,39.705,5.400000,Ingreso bajo
130,Netherlands,NLD,10.200,93.956400,Ingreso alto
140,Poland,POL,9.600,62.849200,Ingreso alto
150,Sudan,SDN,33.477,22.700000,Ingreso medio bajo
160,Suriname,SUR,18.455,37.400000,Ingreso medio alto
170,Tajikistan,TJK,30.792,16.000000,Ingreso medio bajo
180,Uruguay,URY,14.374,57.690000,Ingreso alto
190,"Yemen, Rep.",YEM,32.947,20.000000,Ingreso medio bajo

In [109]:
sub10.at[10,'Nombre del Pais']

'Azerbaijan'

In [38]:
sub10.iat[10,0]

'Libya'

### Unir dos dataframe

Datos es un dataframe ya existente q tiene una columna llamada CodigoPais q es igual q la del dataframe datos_paises

In [ ]:
import numpy as np

datos_paises = pd.DataFrame({"NombrePais": np.array(paises_datos_2012), 
                             "CodigoPais": np.array(paises_datos_2012), 
                             "RegionPais": np.array(paises_datos_2012)})

#mergeamos los datos
datos_unidos = pd.merge(left=datos, right=datos_paises, how='inner', on='CodigoPais')
datos_unidos

## Curso udemy Machine Learning

In [64]:
#DATAFRAMES
import numpy as np
import pandas as pd

filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,421,256],[234,541,257],[120,451,258]]
dataframe = pd.DataFrame(datos, filas, columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [51]:
#seleccionar una fila
dataframe.loc['ventas1']

zonaA    123
zonaB    421
zonaC    256
Name: ventas1, dtype: int64

In [53]:
#selecionar varias filas
dataframe.loc[['ventas1', 'ventas3']]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas3    120    451    258

In [55]:
#seleccionar varias columnas
dataframe[['zonaA','zonaC']]

         zonaA  zonaC
ventas1    123    256
ventas2    234    257
ventas3    120    258

In [57]:
dataframe.loc['ventas1']['zonaC']

256

In [59]:
#EJERCICIO  2
#crear un dataframe con los datos dados e imprimir la ventas de enero para la oficina1

import numpy as np
import pandas as pd

ventas_enero = np.random.randint(101,501,3)
ventas_febrero = np.random.randint(101,501,3)
ventas_marzo = np.random.randint(101,501,3)
filas = ['ventas_enero', 'ventas_febrero', 'ventas_marzo']
columnas = ['oficina_1', 'oficina_2', 'oficina_3']
ventas = np.array([ventas_enero, ventas_febrero, ventas_marzo])

dataframe = pd.DataFrame(ventas, filas, columnas)

print(f'Las ventas de enero para la oficina 1 son: {str(dataframe.loc['ventas_enero']['oficina_1'])}')

Las ventas de enero para la oficina 1 son: 157

### OPERACIONES DATAFRAMES

In [66]:
dataframe['TodaslasZonas'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  TodaslasZonas
ventas1    123    421    256            800
ventas2    234    541    257           1032
ventas3    120    451    258            829

#### Borrar la columna

In [69]:
dataframe.drop('TodaslasZonas', axis=1, inplace=True)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

#### Condiciones

In [72]:
condicion = dataframe > 200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    421    256
ventas2  234.0    541    257
ventas3    NaN    451    258

In [74]:
condicion2 = dataframe ['zonaA'] > 121
dataframe[condicion2]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [76]:
condicion3 = (dataframe ['zonaA'] > 121) | (dataframe ['zonaB'] > 500)
dataframe[condicion3]

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257

In [78]:
dataframe[condicion3][['zonaB','zonaC']]

         zonaB  zonaC
ventas1    421    256
ventas2    541    257

#### Cambiar el nombre de las filas

In [81]:
import numpy as np
import pandas as pd

filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,421,256],[234,541,257],[120,451,258]]
dataframe = pd.DataFrame(datos, filas, columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    421    256
ventas2    234    541    257
ventas3    120    451    258

In [83]:
nuevas_filas = 'dia1 dia2 dia3'.split()
dataframe['dias'] = nuevas_filas
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    123    421    256  dia1
ventas2    234    541    257  dia2
ventas3    120    451    258  dia3

In [85]:
dataframe = dataframe.set_index('dias')
dataframe

      zonaA  zonaB  zonaC
dias
dia1    123    421    256
dia2    234    541    257
dia3    120    451    258

#### Tratar valores nulos

In [94]:
import numpy as np
import pandas as pd

diccionario = {'A':[4,5,np.nan], 'B':[6,1,5], 'C':[np.nan,4, np.nan]}
dataframe = pd.DataFrame(diccionario)
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [90]:
# Borrar por filas
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [98]:
# Borrar por columnas (axis 1), con implace true se borra definitivamente
# en las nuevas versiones de pandas ya no se utiliza implace
dataframe_sin_nulos = dataframe.dropna(axis=1)

In [100]:
# para rellenar columnas
dataframe.fillna(value=100)

       A  B      C
0    4.0  6  100.0
1    5.0  1    4.0
2  100.0  5  100.0

In [102]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [104]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0

In [106]:
# EJEMPLO

In [108]:
'''
Rellenar Valores Nulos con la Media de una Columna
Desarrolla una función llamada rellenar_con_media que tome como entrada un DataFrame de pandas y el nombre de una columna. La función debe calcular la media de esa columna y luego llenar los valores nulos en esa columna con la media calculada.

def rellenar_con_media(dataframe, columna):
# Ejemplo de uso
    data = {
        'nombre': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
        'edad': [20, None, 18, 25, None],
        'calificaciones': [90, 88, None, None, 95]
    }
     
    df = pd.DataFrame(data)
    columna = 'calificaciones'
     
    resultado = rellenar_con_media(df, columna)
    print(resultado)
'''

import pandas as pd


def rellenar_con_media(dataframe, columna):
    valor_medio = dataframe[columna].mean()
    columna_nueva = dataframe[columna].fillna(valor_medio)
    dataframe.drop(columna, axis=1, inplace=True)
    dataframe[columna] = columna_nueva
    return dataframe

data = {
    'nombre': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'edad': [20, None, 18, 25, None],
    'calificaciones': [90, 88, None, None, 95]
}

df = pd.DataFrame(data)
columna = 'calificaciones'

resultado = rellenar_con_media(df, columna)
print(resultado)

    nombre  edad  calificaciones
0    Alice  20.0            90.0
1      Bob   NaN            88.0
2  Charlie  18.0            91.0
3    David  25.0            91.0
4      Eve   NaN            95.0

#### Agrupación de datos

In [111]:
import numpy as np
import pandas as pd

diccionario = {'dias':['dia1', 'dia1', 'dia2', 'dia2', 'dia3'], 'vendedores': 
               ['Antonio', 'Maria', 'Jose', 'Marta', 'Juan'], 'ventas': [100,400,200,500,300]}
dataframe_1 = pd.DataFrame(diccionario)
dataframe_1

   dias vendedores  ventas
0  dia1    Antonio     100
1  dia1      Maria     400
2  dia2       Jose     200
3  dia2      Marta     500
4  dia3       Juan     300

#### Agrupación y suma

In [114]:
dataframe_1.groupby('dias')['ventas'].mean()

dias
dia1    250.0
dia2    350.0
dia3    300.0
Name: ventas, dtype: float64

In [116]:
dataframe_1.groupby('dias')['ventas'].sum()

dias
dia1    500
dia2    700
dia3    300
Name: ventas, dtype: int64

In [118]:
dataframe_1.groupby('dias')['ventas'].describe()

      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

#### Combinar dataframes

In [121]:
import numpy as np
import pandas as pd

diccionario = {'A':[1,2,3], 'B':[4,5,6], 'C':[7,8,9]}
dataframe = pd.DataFrame(diccionario)
dataframe

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [123]:
diccionario_2 = {'A':[11,12,13], 'B':[14,15,16], 'C':[17,18,19]}
dataframe_2 = pd.DataFrame(diccionario_2)
dataframe_2

    A   B   C
0  11  14  17
1  12  15  18
2  13  16  19

#### Concatenar en horizontal y vertical

In [125]:

pd.concat([dataframe, dataframe_2])

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19

In [127]:
pd.concat([dataframe, dataframe_2], axis=1)

   A  B  C   A   B   C
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

#### Merge en dataframes

In [131]:
import numpy as np
import pandas as pd

diccionario = {'A':[1,2,3], 'B':[4,5,6], 'clave': ['c1','c2','c3']}
dataframe1 = pd.DataFrame(diccionario)
dataframe1

   A  B clave
0  1  4    c1
1  2  5    c2
2  3  6    c3

In [133]:
diccionario2 = {'C':[11,12,13], 'D':[14,15,16], 'clave': ['c1','c2','c3']}
dataframe2 = pd.DataFrame(diccionario2)
dataframe2

    C   D clave
0  11  14    c1
1  12  15    c2
2  13  16    c3

In [135]:
pd.merge(dataframe1, dataframe2, on='clave')

   A  B clave   C   D
0  1  4    c1  11  14
1  2  5    c2  12  15
2  3  6    c3  13  16

#### Join en dataframes   
Si uno de los dataframes tiene mas valores, los valores en las otras columnas saldrían como nulos

In [138]:
import numpy as np
import pandas as pd
#tienen los mismos indices
diccionario = {'A':[1,2,3], 'B':[4,5,6]}
dataframe1 = pd.DataFrame(diccionario, index=['i1','i2','i3'])
diccionario2 = {'C':[11,12,13], 'D':[14,15,16]}
dataframe2 = pd.DataFrame(diccionario2, index=['i1','i2','i3'])
dataframe1.join(dataframe2)

    A  B   C   D
i1  1  4  11  14
i2  2  5  12  15
i3  3  6  13  16

#### Operaciones

In [141]:
import numpy as np
import pandas as pd

diccionario = {'A':[11,12,13,11], 'B':[14,10,16,17]}
dataframe1 = pd.DataFrame(diccionario, index=['i1','i2','i3', 'i4'])
dataframe1

     A   B
i1  11  14
i2  12  10
i3  13  16
i4  11  17

Valores únicos

In [144]:
dataframe1['A'].unique()

array([11, 12, 13], dtype=int64)

In [146]:
#num valores unicos
dataframe1['A'].nunique()

3

In [148]:
#num ocurrencias de cada valor
dataframe1['A'].value_counts()

A
11    2
12    1
13    1
Name: count, dtype: int64

#### Aplicar función

In [151]:
def multiplicar(x):
    return x * 2

dataframe1['A'].apply(multiplicar)

i1    22
i2    24
i3    26
i4    22
Name: A, dtype: int64

In [153]:
# igual con lambda

In [155]:
dataframe1['A'].apply(lambda x:x*2)

i1    22
i2    24
i3    26
i4    22
Name: A, dtype: int64

In [157]:
# para borrar

In [159]:
dataframe1.drop('B', axis=1)

     A
i1  11
i2  12
i3  13
i4  11

In [161]:
dataframe1.drop('i1')

     A   B
i2  12  10
i3  13  16
i4  11  17

In [163]:
dataframe1.columns

Index(['A', 'B'], dtype='object')

In [165]:
dataframe1.index

Index(['i1', 'i2', 'i3', 'i4'], dtype='object')

#### Ordenar

In [168]:
dataframe1.sort_values('B')

     A   B
i2  12  10
i1  11  14
i3  13  16
i4  11  17

## DATAFRAME DESDE EXCEL

In [ ]:
pwd

dataframe = pd.read_excel('recursos/Ejemplo_excel.xlsx')
dataframe

#### Añadimos una columna

In [188]:
dataframe['e'] = [20,21,22,23]
dataframe

   Unnamed: 0   a   b   c   d   e
0           0   0   1   2   3  20
1           1   4   5   6   7  21
2           2   8   9  10  11  22
3           3  12  13  14  15  23

#### Guardamos en otro excel

In [191]:
dataframe.to_excel('salida_excel.xlsx', sheet_name='Hoja1')

## LEER PAGINAS WEB

In [194]:
import pandas as pd
pagina_web = 'https://es.wikipedia.org/wiki/Anexo:Pa%C3%ADses_y_territorios_dependientes_por_poblaci%C3%B3n'
datos = pd.read_html(pagina_web)
dataframe = datos[0]
dataframe.head(10)

,N.º,País (o territorio dependiente),Proyección exponencial de la población al 1/1/2025[7]​,Total mun- dial (%),Cambio medio anual (%)[8]​,Cambio absoluto anual promedio,Cambio medio abs. total anual (%),Años para even- tual du- pli- ca- ción[9]​,"Censo más reciente, última estimación oficial, proyección de la ONU o reloj de población nacional",Fecha de esta última cifra de población en particular (d/mm/aaaa)[10]​,Tipo[11]​,Enlace o hipervínculo (usualmente de tipo oficial) de esta última cifra de población
0,1,India,1 411 278 000,1753,090,12 726 000,1507,77,1 404 910 000,1/07/2024,A,web.archive.org
1,2,China[12]​,1 407 582 000,1749,-015,-2 075 000,-,-,1 409 670 000,31/12/2023,E,www.stats.gov.cn
2,3,Estados Unidos,337 642 000,419,052,1 754 000,208,134,337 464 000,24/11/2024,R,www.census.gov
3,4,Indonesia,284 144 000,353,117,3 318 000,393,60,282 477 584,30/06/2024,E,dispendukcapil.acehtimurkab.go.id
4,5,Pakistán,253 010 000,314,256,6 485 000,768,27,241 499 431,1/03/2023,C,www.pbs.gov.pk
5,6,Nigeria,233 077 000,290,273,6 372 000,755,26,223 800 000,1/07/2023,E,cdn.sanity.io
6,7,Brasil,205 661 000,256,052,1 076 000,127,133,203 080 756,1/08/2022,C,censo2022.ibge.gov.br
7,8,Bangladés,176 284 000,219,147,2 599 000,308,47,169 828 911,15/06/2022,C,bdnews24.com
8,9,Rusia[13]​,146 461 000,182,018,257 000,030,396,146 203 613,1/01/2024,E,rosstat.gov.ru
9,10,México,133 340 000,166,118,1 579 000,187,59,126 014 024,15/03/2020,C,www.inegi.org.mx

## DATOS CATEGORICOS

In [201]:
#datos categoricos
import pandas as pd
import os

# para saber el path
os.getcwd()

path = "PATH"
peliculas = pd.read_csv(path + '/' + 'RatingsPeliculas.csv')
peliculas.head()

,Pelicula,Genero,Ratings de Rotten Tomatoes %,Ratings de la Audience %,Presupuesto (millones USD),Lanzamiento
0,(500) Days of Summer,Comedia,87,81,8,2009
1,"10,000 B.C.",Aventura,9,44,105,2008
2,12 Rounds,Accion,30,52,20,2009
3,127 Hours,Aventura,93,84,18,2010
4,17 Again,Comedia,55,70,20,2009

Películas.info() para saber que tipo de datos tenemos   
Películas.describe() para ver las medias de los numéricos   
Películas.Pelicula para ver la columna Película

### Cambiar el tipo de dato en una columna

In [206]:
peliculas.columns = ['Pelicula', 'Genero', 'RatingsCriticos', 'RatingsAudiencia', \
                    'PresupuestoMillones', 'Anyo']

peliculas.head()

,Pelicula,Genero,RatingsCriticos,RatingsAudiencia,PresupuestoMillones,Anyo
0,(500) Days of Summer,Comedia,87,81,8,2009
1,"10,000 B.C.",Aventura,9,44,105,2008
2,12 Rounds,Accion,30,52,20,2009
3,127 Hours,Aventura,93,84,18,2010
4,17 Again,Comedia,55,70,20,2009

In [208]:
peliculas.Pelicula = peliculas.Pelicula.astype('category')
peliculas.Genero = peliculas.Genero.astype('category')
peliculas.Anyo = peliculas.Anyo.astype('category')

In [210]:
peliculas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Pelicula             559 non-null    category
 1   Genero               559 non-null    category
 2   RatingsCriticos      559 non-null    int64
 3   RatingsAudiencia     559 non-null    int64
 4   PresupuestoMillones  559 non-null    int64
 5   Anyo                 559 non-null    category
dtypes: category(3), int64(3)
memory usage: 36.5 KB